using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Grain.Models
{
    public class JournaledEvent : BaseEvent
    {
        public string Test1 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";

        public string Test2 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";

        public string Test3 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";

        public string Test4 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test5 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test6 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test7 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test8 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test9 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";
        
        public string Test10 { get; set; } = "字符串主要用于编程，概念说明、函数解释、用法详述见正文，这里补充一点：字符串在存储上类似字符数组，所以它每一位的单个元素都是可以提取的，这可以给我们提供很多方便，如高精度运算时每一位都可以转化为数字";

    }
}
